MiEcosystem/mijia_ble_api/nRF5_api.c
// Copyright [2017] [Beijing Xiaomi Mobile Software Co., Ltd]
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//    http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "mible_api.h"
#include "mible_type.h"
#include "mible_log.h"

#include "nrf_soc.h"
#include "nrf_queue.h"

#include "ble_types.h"
#include "ble.h"
#include "ble_hci.h"
#include "ble_gap.h"
#include "ble_gattc.h"
#include "ble_gatts.h"

#include "app_timer.h"


#include "mi_psm.h"
#include "mible_server.h"

#define TIMER_MAX_NUM             4

typedef struct {
	mible_handler_t handler;
	void *arg;
} mible_task_t;

typedef struct {
	uint8_t is_avail;
	app_timer_t data;
} timer_item_t;

static timer_item_t m_timer_pool[TIMER_MAX_NUM] = {
	[0] = { .is_avail = 1},
	[1] = { .is_avail = 1},
	[2] = { .is_avail = 1},
	[3] = { .is_avail = 1}
};

static app_timer_t* find_timer()
{
	uint8_t i;
	for (i = 0; i < TIMER_MAX_NUM; i++) {
		if (m_timer_pool[i].is_avail) {
			m_timer_pool[i].is_avail = 0;
			return (void*)&m_timer_pool[i].data ;
		}
	}
	return NULL;
}

static int free_timer(void* timer_id)
{
	for (uint8_t i = 0; i < TIMER_MAX_NUM; i++) {
		if (timer_id == &m_timer_pool[i].data) {
			m_timer_pool[i].is_avail = 1;
			return i;
		}
	}
	return -1;
}

NRF_QUEUE_DEF(mible_task_t, task_queue, 4, NRF_QUEUE_MODE_OVERFLOW);

/*
 * Add your own include file
 *
 * */

/* GAP, GATTS, GATTC event callback function */

/**
 *@brief    This function is MIBLE GAP related event callback function.
 *@param    [in] evt : GAP EVENT
 *			[in] param : callback parameters corresponding to evt
 *@return   Void
 *@note     You should support this function in your own ble stack .
 *          Make sure when the corresponding event occurs, be able to call this
 *function
 *          and pass in the corresponding parameters.
*/
void mible_gap_event_callback(mible_gap_evt_t evt,
    mible_gap_evt_param_t* param)
{
    switch (evt) {
    case MIBLE_GAP_EVT_CONNECTED:
		mible_std_server_gap_evt_connected(param); 
        break;
    case MIBLE_GAP_EVT_DISCONNET:
		mible_std_server_gap_evt_disconnected(param);
        break;
    case MIBLE_GAP_EVT_ADV_REPORT:
        mible_std_server_gap_evt_scan_report(param); 
		break;
    case MIBLE_GAP_EVT_CONN_PARAM_UPDATED:
//		mible_std_server_gap_evt_conn_params_updated(param);
        break;
    }
}
/**
 *@brief    This function is MIBLE GATTS related event callback function.
 *@param    [in] evt : GATTS EVENT
 *			[in] param : callback parameters corresponding to evt
 *@return   Void
 *@note     You should support this function in your own ble stack .
            Make sure when the corresponding event occurs, be able to call this
 function and pass in the corresponding parameters.
*/
void mible_gatts_event_callback(mible_gatts_evt_t evt,
    mible_gatts_evt_param_t* param)
{
    switch (evt) {
    case MIBLE_GATTS_EVT_WRITE:
		mible_std_server_gatts_evt_write(param);
        break;

    case MIBLE_GATTS_EVT_READ_PERMIT_REQ:
		mible_std_server_gatts_evt_read_permit_req(param);
        break;

    case MIBLE_GATTS_EVT_WRITE_PERMIT_REQ:
		mible_std_server_gatts_evt_write_permit_req(param);
        break;

	case MIBLE_GATTS_EVT_IND_CONFIRM:
		break;
    }
}

/**
 *@brief    This function is MIBLE GATTC related event callback function.
 *@param    [in] evt : GATTC EVENT
 *			[in] param : callback parameters corresponding to evt
 *@return   Void
 *@note     You should support this function in your own ble stack .
            Make sure when the corresponding event occurs, be able to call this
 function and pass in the corresponding parameters.
*/
void mible_gattc_event_callback(mible_gattc_evt_t evt,
    mible_gattc_evt_param_t* param)
{
    switch (evt) {
    case MIBLE_GATTC_EVT_PRIMARY_SERVICE_DISCOVER_RESP:
        break;
    case MIBLE_GATTC_EVT_CHR_DISCOVER_BY_UUID_RESP:
        break;
    case MIBLE_GATTC_EVT_CCCD_DISCOVER_RESP:
        break;
    case MIBLE_GATTC_EVT_READ_CHAR_VALUE_BY_UUID_RESP:
        break;
    case MIBLE_GATTC_EVT_WRITE_RESP:
        break;
    default:
		;
    }
}
/*
 *@brief 	This function is mible_arch api related event callback function.
 *@param 	[in] evt: asynchronous function complete event 
 *			[in] param: the return of asynchronous function 
 *@note  	You should support this function in corresponding asynchronous function. 
 *          For now, mible_gatts_service_int and mible_record_write is asynchronous. 
 * */
void mible_arch_event_callback(mible_arch_event_t evt, 
		mible_arch_evt_param_t* param)
{
	switch(evt) {
		case MIBLE_ARCH_EVT_GATTS_SRV_INIT_CMP:
			mible_std_server_arch_service_init_complete(param->srv_init_cmp);
		break;
		case MIBLE_ARCH_EVT_RECORD_WRITE_CMP:
			
		break;
	}
}


/*
 * @brief 	Get BLE mac address.
 * @param 	[out] mac: pointer to data
 * @return  MI_SUCCESS			The requested mac address were written to mac
 *          MI_ERR_INTERNAL     No mac address found.
 * @note: 	You should copy gap mac to mac[6]  
 * */
mible_status_t mible_gap_address_get(mible_addr_t mac)
{
	uint32_t errno;
	ble_gap_addr_t gap_addr;
	errno = sd_ble_gap_address_get(&gap_addr);
	memcpy(mac, gap_addr.addr, 6);
	return (mible_status_t)errno;
}

/* GAP related function.  You should complement these functions. */

/*
 * @brief	Start scanning
 * @param 	[in] scan_type:	passive or active scaning
 * 			[in] scan_param: scan parameters including interval, windows
 * and timeout
 * @return  MI_SUCCESS             Successfully initiated scanning procedure.
 *          MI_ERR_INVALID_STATE   Has initiated scanning procedure.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 * 		    MI_ERR_BUSY 		   The stack is busy, process pending
 * events and retry.
 * @note 	Other default scanning parameters : public address, no
 * whitelist.
 * 	        The scan response is given through
 * MIBLE_GAP_EVT_ADV_REPORT event
 */
mible_status_t mible_gap_scan_start(mible_gap_scan_type_t scan_type,
    mible_gap_scan_param_t scan_param)
{
    return MI_SUCCESS;
}

