MiEcosystem/mijia_ble_api/nRF5_api.c
/*
 * @brief	Stop scanning
 * @param 	void
 * @return  MI_SUCCESS             Successfully stopped scanning procedure.
 *          MI_ERR_INVALID_STATE   Not in scanning state.
 * */
mible_status_t mible_gap_scan_stop(void) { return MI_SUCCESS; }

/*
 * @brief	Start advertising
 * @param 	[in] p_adv_param : pointer to advertising parameters, see
 * mible_gap_adv_param_t for details
 * @return  MI_SUCCESS             Successfully initiated advertising procedure.
 *          MI_ERR_INVALID_STATE   Initiated connectable advertising procedure
 * when connected.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and
 * retry.
 *          MI_ERR_RESOURCES       Stop one or more currently active roles
 * (Central, Peripheral or Observer) and try again.
 * @note	Other default advertising parameters: local public address , no
 * filter policy
 * */
mible_status_t mible_gap_adv_start(mible_gap_adv_param_t *p_adv_param)
{
	uint32_t errno;
	if (p_adv_param == NULL )
		return MI_ERR_INVALID_PARAM;

	errno = sd_ble_gap_adv_data_set(p_adv_param->adv_data, p_adv_param->adv_len, p_adv_param->scan_rsp_data, p_adv_param->scan_rsp_len);
    MI_ERR_CHECK(errno);

	ble_gap_adv_params_t adv_params = {0};
	adv_params.channel_mask.ch_37_off = p_adv_param->ch_mask.ch_37_off;
	adv_params.channel_mask.ch_38_off = p_adv_param->ch_mask.ch_38_off;
	adv_params.channel_mask.ch_39_off = p_adv_param->ch_mask.ch_39_off;
	adv_params.interval = p_adv_param->adv_interval_min;

	switch(p_adv_param->adv_type) {
		case MIBLE_ADV_TYPE_CONNECTABLE_UNDIRECTED:
			adv_params.type = BLE_GAP_ADV_TYPE_ADV_IND;
			break;

		case MIBLE_ADV_TYPE_SCANNABLE_UNDIRECTED:
			adv_params.type = BLE_GAP_ADV_TYPE_ADV_SCAN_IND;
			break;
			
		case MIBLE_ADV_TYPE_NON_CONNECTABLE_UNDIRECTED:
			adv_params.type = BLE_GAP_ADV_TYPE_ADV_NONCONN_IND;
			break;
	}
	
	errno = sd_ble_gap_adv_start(&adv_params);
	MI_ERR_CHECK(errno);
	
    return MI_SUCCESS;
}
/*
 * @brief	Stop advertising
 * @param	void
 * @return  MI_SUCCESS             Successfully stopped advertising procedure.
 *          MI_ERR_INVALID_STATE   Not in advertising state.
 * */
mible_status_t mible_gap_adv_stop(void)
{
	uint32_t errno;
	errno = sd_ble_gap_adv_stop();
	errno = errno == NRF_SUCCESS ? MI_SUCCESS : MI_ERR_INVALID_STATE;
	return (mible_status_t)errno;
}

/*
 * @brief  	Create a Direct connection
 * @param   [in] scan_param : scanning parameters, see TYPE
 * mible_gap_scan_param_t for details.
 * 			[in] conn_param : connection parameters, see TYPE
 * mible_gap_connect_t for details.
 * @return  MI_SUCCESS             Successfully initiated connection procedure.
 *          MI_ERR_INVALID_STATE   Initiated connection procedure in connected state.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and retry.
 *          MI_ERR_RESOURCES       Stop one or more currently active roles
 * (Central, Peripheral or Observer) and try again
 *          MIBLE_ERR_GAP_INVALID_BLE_ADDR    Invalid Bluetooth address
 * supplied.
 * @note 	Own and peer address are both public.
 * 			The connection result is given by MIBLE_GAP_EVT_CONNECTED
 * event
 * */
mible_status_t mible_gap_connect(mible_gap_scan_param_t scan_param,
    mible_gap_connect_t conn_param)
{
    return MI_SUCCESS;
}

/*
 * @brief	Disconnect from peer
 * @param 	[in] conn_handle: the connection handle
 * @return  MI_SUCCESS             Successfully disconnected.
 *          MI_ERR_INVALID_STATE   Not in connnection.
 *          MIBLE_ERR_INVALID_CONN_HANDLE
 * @note 	This function can be used by both central role and periphral
 * role.
 * */
mible_status_t mible_gap_disconnect(uint16_t conn_handle)
{
	uint32_t errno;
	errno = sd_ble_gap_disconnect(conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
	errno = errno == NRF_SUCCESS ? MI_SUCCESS : MI_ERR_INVALID_STATE;
	return (mible_status_t)errno;
}

/*
 * @brief	Update the connection parameters.
 * @param  	[in] conn_handle: the connection handle.
 *			[in] conn_params: the connection parameters.
 * @return  MI_SUCCESS             The Connection Update procedure has been
 *started successfully.
 *          MI_ERR_INVALID_STATE   Initiated this procedure in disconnected
 *state.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_BUSY            The stack is busy, process pending events and
 *retry.
 *          MIBLE_ERR_INVALID_CONN_HANDLE
 * @note  	This function can be used by both central role and peripheral
 *role.
 * */
mible_status_t mible_gap_update_conn_params(uint16_t conn_handle,
    mible_gap_conn_param_t conn_params)
{
	uint32_t errno;
	errno = sd_ble_gap_conn_param_update(conn_handle, (ble_gap_conn_params_t*)&conn_params);
	errno = errno == NRF_SUCCESS ? MI_SUCCESS : MI_ERR_INVALID_STATE;
	return (mible_status_t)errno;
}

/* GATTS related function  */

static ble_uuid_t convert_uuid(mible_uuid_t *p_uuid)
{
	uint32_t errno;
	ble_uuid_t uuid16 = {0};
	if (p_uuid->type == 0) {
		uuid16.type = 1;
		uuid16.uuid = p_uuid->uuid16;
	} else {
		ble_uuid128_t vs_uuid = {0};
		memcpy(vs_uuid.uuid128, p_uuid->uuid128, 16);
		errno = sd_ble_uuid_vs_add(&vs_uuid, &uuid16.type);
		MI_ERR_CHECK(errno);
		
		uuid16.uuid = vs_uuid.uuid128[13] << 8 | vs_uuid.uuid128[12];
	}
	
	return uuid16;
}

static uint32_t char_add(uint16_t                       service_handle,
	                     ble_uuid_t                     *p_uuid,
                         uint8_t                        *p_char_value,
                         uint16_t                        char_len,
                         ble_gatt_char_props_t           char_props,
                         uint16_t                       *p_value_handle,
	bool is_vlen, bool rd_auth, bool wr_auth)
{
	uint32_t errno;
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_t    attr_char_value;
    ble_gatts_attr_md_t attr_md;
    ble_gatts_attr_md_t cccd_md;
	ble_gatts_char_handles_t handles;
    // The ble_gatts_attr_md_t structure uses bit fields. So we reset the memory to zero.
    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props = char_props;

    if (char_props.notify) {
		memset(&cccd_md, 0, sizeof(cccd_md));
		cccd_md.vloc         = BLE_GATTS_VLOC_STACK;
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.read_perm);
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cccd_md.write_perm);
        char_md.p_cccd_md    = &cccd_md;
    } else {
        char_md.p_cccd_md    = NULL;
    }

    memset(&attr_md, 0, sizeof(attr_md));

	if (char_props.read) {
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.read_perm);
	}
	if (char_props.write || char_props.write_wo_resp) {
		BLE_GAP_CONN_SEC_MODE_SET_OPEN(&attr_md.write_perm);
	}

    attr_md.vloc       = p_char_value == NULL ? BLE_GATTS_VLOC_STACK : BLE_GATTS_VLOC_USER;
    attr_md.rd_auth    = rd_auth;
    attr_md.wr_auth    = wr_auth;
    attr_md.vlen       = is_vlen;

