MiEcosystem/mijia_ble_api/nRF5_api.c
    memset(&attr_char_value, 0, sizeof(attr_char_value));

    attr_char_value.p_uuid    = p_uuid;
    attr_char_value.p_attr_md = &attr_md;
    attr_char_value.max_len   = char_len;
    attr_char_value.p_value   = p_char_value ? p_char_value : NULL;

    errno = sd_ble_gatts_characteristic_add(service_handle,
	                                       &char_md,
	                                       &attr_char_value,
	                                       &handles);

	*p_value_handle = handles.value_handle;
	return (mible_status_t)errno;
}

/*
 * @brief	Add a Service to a GATT server
 * @param 	[in|out] p_server_db: pointer to mible service data type 
 * of mible_gatts_db_t, see TYPE mible_gatts_db_t for details. 
 * @return  MI_SUCCESS             Successfully added a service declaration.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter(s) supplied.
 *          MI_ERR_NO_MEM	       Not enough memory to complete operation.
 * @note    This function can be implemented asynchronous. When service inition complete, call mible_arch_event_callback function and pass in MIBLE_ARCH_EVT_GATTS_SRV_INIT_CMP event and result.
 * */
mible_status_t mible_gatts_service_init(mible_gatts_db_t *p_server_db)
{
	uint32_t errno;
	ble_uuid_t uuid16 = {0};
	
	if (p_server_db == NULL)
		return MI_ERR_INVALID_ADDR;

	for (uint8_t idx = 0, max = p_server_db->srv_num; idx < max; idx++) {
		mible_gatts_srv_db_t service = p_server_db->p_srv_db[idx];

		// add vendor specific uuid
		uuid16 = convert_uuid(&service.srv_uuid);
		
		// add service
		errno = sd_ble_gatts_service_add(
			service.srv_type == MIBLE_PRIMARY_SERVICE ? BLE_GATTS_SRVC_TYPE_PRIMARY : BLE_GATTS_SRVC_TYPE_SECONDARY,
			&uuid16, &service.srv_handle);
		MI_ERR_CHECK(errno);

		// add charateristic
		for (uint8_t idx = 0, max = service.char_num; idx < max; idx++) {
			mible_gatts_char_db_t char_item = service.p_char_db[idx];
			ble_gatt_char_props_t props = {0};
			memcpy((uint8_t*)&props, &char_item.char_property, 1);
			uuid16 = convert_uuid(&char_item.char_uuid);
			errno = char_add(service.srv_handle, &uuid16, NULL, char_item.char_value_len,
					    props, &char_item.char_value_handle,
						char_item.is_variable_len, char_item.rd_author, char_item.wr_author);
			MI_ERR_CHECK(errno);
		}
	}
	mible_arch_evt_param_t param;
	memset(&param, 0, sizeof(param));
	param.srv_init_cmp.status = MI_SUCCESS;
	param.srv_init_cmp.p_gatts_db = p_server_db;
	mible_arch_event_callback(MIBLE_ARCH_EVT_GATTS_SRV_INIT_CMP, &param);
	return MI_SUCCESS;
}

/*
 * @brief	Set characteristic value
 * @param	[in] srv_handle: service handle
 *			[in] value_handle: characteristic value handle
 *			[in] offset: the offset from which the attribute value has
 *to be updated
 *			[in] p_value: pointer to data
 *			[in] len: data length
 * @return  MI_SUCCESS             Successfully retrieved the value of the
 *attribute.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 *          MIBLE_ERR_GATT_INVALID_ATT_TYPE  Attributes are not modifiable by
 *the application.
 * */
mible_status_t mible_gatts_value_set(uint16_t srv_handle, uint16_t value_handle,
    uint8_t offset, uint8_t* p_value,
    uint8_t len)
{
	uint32_t errno;
	ble_gatts_value_t value = {
		.len     = len,
		.offset  = offset,
		.p_value = p_value
	};
    errno = sd_ble_gatts_value_set(BLE_CONN_HANDLE_INVALID, value_handle, &value);
	MI_ERR_CHECK(errno);
	return (mible_status_t)errno;
}

/*
 * @brief	Get charicteristic value as a GATTS.
 * @param 	[in] srv_handle: service handle
 * 			[in] value_handle: characteristic value handle
 *			[out] p_value: pointer to data which stores characteristic value
 * 			[out] p_len: pointer to data length.
 * @return  MI_SUCCESS             Successfully get the value of the attribute.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 **/
mible_status_t mible_gatts_value_get(uint16_t srv_handle, uint16_t char_handle,
    uint8_t* p_value, uint8_t *p_len)
{
	uint32_t errno;
	ble_gatts_value_t value = {0};
    errno = sd_ble_gatts_value_get(BLE_CONN_HANDLE_INVALID, char_handle, &value);
	MI_ERR_CHECK(errno);
	memcpy(p_value, value.p_value, value.len);
	*p_len = value.len;
    return (mible_status_t)errno;
}

/*
 * @brief 	GATT Read or Write Authorize Reply parameters.
 * @param 	[in] conn_handle: conn handle
 *          [in] status_code: permitted = 1; not permitted = 2;
 *          [in] type : read = 1; write = 2;
 * 			[in] offset: the offset from which the attribute value has to
 * be updated
 * 			[in] len: data length
 * 			[in] pdata: pointer to data
 *
 * @return  MI_SUCCESS             Successfully queued a response to the peer, 
 * and in the case of a write operation, Attribute Table updated.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State or no authorization request pending.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 *          MIBLE_ERR_GATT_INVALID_ATT_TYPE   Attributes are not modifiable by
 * the application.
 * */
mible_status_t mible_gatts_rw_auth_reply(uint16_t conn_handle, uint8_t status_code,
	uint8_t type, uint16_t offset, uint16_t len, uint8_t *pdata)
{
	ble_gatts_rw_authorize_reply_params_t reply = {0};
	
	if (status_code == 1) {
		switch (type) {
		case 1:
			reply = (ble_gatts_rw_authorize_reply_params_t) {
				.type = BLE_GATTS_AUTHORIZE_TYPE_READ,
				.params.read.gatt_status = BLE_GATT_STATUS_SUCCESS,
				.params.read.p_data      = pdata,
				.params.read.len         = len
			};
			break;

