MiEcosystem/mijia_ble_api/nRF5_api.c
		case 2:
			reply = (ble_gatts_rw_authorize_reply_params_t) {
				.type = BLE_GATTS_AUTHORIZE_TYPE_WRITE,
				.params.write.gatt_status = BLE_GATT_STATUS_SUCCESS,
				.params.write.update      = 1,
				.params.write.p_data      = pdata,
				.params.write.len         = len
			};
			break;
		}
	} else if (status_code == 2) {
		switch (type) {
		case 1:
			reply.params.read.gatt_status = BLE_GATT_STATUS_ATTERR_READ_NOT_PERMITTED;
			break;

		case 2:
			reply.params.write.gatt_status = BLE_GATT_STATUS_ATTERR_WRITE_NOT_PERMITTED;
			break;
		}
	}

	uint32_t errno = sd_ble_gatts_rw_authorize_reply(conn_handle, &reply);
	
	return (mible_status_t)errno;
}

// this function set char value and notify/indicate it to client
/*
 * @brief 	Set characteristic value and notify it to client.
 * @param 	[in] conn_handle: conn handle
 *          [in] srv_handle: service handle
 * 			[in] char_value_handle: characteristic handle
 * 			[in] offset: the offset from which the attribute value has to
 * be updated
 * 			[in] p_value: pointer to data
 * 			[in] len: data length
 *          [in] type : notification = 1; indication = 2;
 *
 * @return  MI_SUCCESS             Successfully queued a notification or
 * indication for transmission,
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_PARAM   Invalid parameter (offset) supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State or notifications
 * and/or indications not enabled in the CCCD.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_ATT_INVALID_HANDLE     Attribute not found.
 *          MIBLE_ERR_GATT_INVALID_ATT_TYPE   //Attributes are not modifiable by
 * the application.
 * @note    This function checks for the relevant Client Characteristic
 * Configuration descriptor
 *          value to verify that the relevant operation (notification or
 * indication) has been enabled by the client.
 * */
mible_status_t mible_gatts_notify_or_indicate(uint16_t conn_handle, uint16_t srv_handle,
    uint16_t char_value_handle, uint8_t offset, uint8_t* p_value,
    uint8_t len, uint8_t type)
{
	uint32_t errno;
	uint16_t length = len;

	ble_gatts_hvx_params_t hvx = {
		.handle = char_value_handle,
		.type   = type,
		.offset = offset,
		.p_data = p_value,
		.p_len  = &length
	};
	errno = sd_ble_gatts_hvx(conn_handle, &hvx);
	MI_ERR_CHECK(errno);
    return MI_SUCCESS;
}



/* GATTC related function */

/*
 * @brief	Discover primary service by service UUID.
 * @param 	[in] conn_handle: connect handle
 * 			[in] handle_range: search range for primary sevice
 *discovery procedure
 * 			[in] uuid_type: 16-bit or 128-bit
 *			[in] p_srv_uuid: pointer to service uuid
 * @return  MI_SUCCESS             Successfully started or resumed the Primary
 *Service Discovery procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE  Invaild connection handle.
 * @note 	The response is given through
 *MIBLE_GATTC_EVT_PRIMARY_SERVICE_DISCOVER_RESP event
 * */
mible_status_t mible_gattc_primary_service_discover_by_uuid(uint16_t conn_handle,
    mible_handle_range_t handle_range,
    mible_uuid_t* p_srv_uuid)
{
    /*tBleStatus errno;*/
    /*errno = aci_att_find_by_type_value_req(conn_handle,start_handle,end_handle,*/
    /*PRIMARY_SERVICE,2,svc_uuid);*/
    /*if( BLE_STATUS_SUCCESS != errno ){*/
    /*return MIBLE_ERR_UNKNOWN;*/
    /*}*/
    return MI_SUCCESS;
}

/*
 * @brief	Discover characteristic by characteristic UUID.
 * @param	[in] conn_handle: connect handle
 * 			[in] handle_range: search range for characteristic discovery
 * procedure
 * 			[in] uuid_type: 16-bit or 128-bit
 * 			[in] p_char_uuid: pointer to characteristic uuid
 * @return  MI_SUCCESS             Successfully started or resumed the
 * Characteristic Discovery procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note 	The response is given through
 * MIBLE_GATTC_CHR_DISCOVER_BY_UUID_RESP event
 * */
mible_status_t
mible_gattc_char_discover_by_uuid(uint16_t conn_handle,
    mible_handle_range_t handle_range,
    mible_uuid_t* p_char_uuid)
{
    return MI_SUCCESS;
}

/*
 * @brief	Discover characteristic client configuration descriptor
 * @param 	[in] conn_handle: connection handle
 * 			[in] handle_range: search range
 * @return  MI_SUCCESS             Successfully started Clien Config Descriptor
 * Discovery procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note	Maybe run the charicteristic descriptor discover procedure firstly,
 * then pick up the client configuration descriptor which att type is 0x2092
 * 			The response is given through MIBLE_GATTC_CCCD_DISCOVER_RESP
 * event
 * 			Only return the first cccd handle within the specified
 * range.
 * */
mible_status_t
mible_gattc_clt_cfg_descriptor_discover(uint16_t conn_handle,
    mible_handle_range_t handle_range)
{
    return MI_SUCCESS;
}

/*
 * @brief	Read characteristic value by UUID
 * @param 	[in] conn_handle: connnection handle
 * 			[in] handle_range: search range
 * 			[in] uuid_type: 16-bit or 128-bit
 * 			[in] char_uuid: characteristic uuid
 * @return  MI_SUCCESS             Successfully started or resumed the Read
 * using Characteristic UUID procedure.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note    The response is given through
 * MIBLE_GATTC_EVT_READ_CHR_VALUE_BY_UUID_RESP event
 * */
mible_status_t
mible_gattc_read_char_value_by_uuid(uint16_t conn_handle,
    mible_handle_range_t handle_range,
    mible_uuid_t *p_char_uuid)
{
    return MI_SUCCESS;
}

