MiEcosystem/mijia_ble_api/nRF5_api.c
/*
 * @brief	Write characteristic value by handle
 * @param 	[in] conn_handle: connection handle
 * 			[in] handle: handle to the attribute to be written.
 * 			[in] p_value: pointer to data
 * 			[in] len: data length
 * @return  MI_SUCCESS             Successfully started the Write with response
 * procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE   Invaild connection handle.
 * @note  	The response is given through MIBLE_GATTC_EVT_WRITE_RESP event
 *
 * */
mible_status_t mible_gattc_write_with_rsp(uint16_t conn_handle, uint16_t handle,
    uint8_t* p_value, uint8_t len)
{
    return MI_SUCCESS;
}

/*
 * @brief 	Write value by handle without response
 * @param   [in] conn_handle: connection handle
 * 			[in] att_handle: handle to the attribute to be written.
 * 			[in] p_value: pointer to data
 * 			[in] len: data length
 * @return  MI_SUCCESS             Successfully started the Write Cmd procedure.
 *          MI_ERR_INVALID_ADDR    Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE   Invalid Connection State.
 *          MI_ERR_INVALID_LENGTH   Invalid length supplied.
 *          MI_ERR_BUSY            Procedure already in progress.
 *          MIBLE_ERR_INVALID_CONN_HANDLE  Invaild connection handle.
 * @note 	no response
 * */
mible_status_t mible_gattc_write_cmd(uint16_t conn_handle, uint16_t att_handle,
    uint8_t* p_value, uint8_t len)
{
    return MI_SUCCESS;
}

/*TIMER related function*/


/*
 * @brief 	Create a timer.
 * @param 	[out] p_timer_id: a pointer to timer id address which can uniquely identify the timer.
 * 			[in] timeout_handler: a pointer to a function which can be
 * called when the timer expires.
 * 			[in] mode: repeated or single shot.
 * @return  MI_SUCCESS             If the timer was successfully created.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *          MI_ERR_INVALID_STATE   timer module has not been initialized or the
 * timer is running.
 *          MI_ERR_NO_MEM          timer pool is full.
 *
 * */


mible_status_t mible_timer_create(void** p_timer_id,
    mible_timer_handler timeout_handler,
    mible_timer_mode mode)
{
	uint32_t errno;
	
	app_timer_id_t id  = find_timer();
	if (id == NULL)
		return MI_ERR_NO_MEM;

	app_timer_mode_t m = mode == MIBLE_TIMER_SINGLE_SHOT ? APP_TIMER_MODE_SINGLE_SHOT : APP_TIMER_MODE_REPEATED;
	app_timer_timeout_handler_t handler = (void*)timeout_handler;
	errno = app_timer_create(&id, m, handler);
	MI_ERR_CHECK(errno);

	return (mible_status_t)errno;
}

/*
 * @brief 	Delete a timer.
 * @param 	[in] timer_id: timer id
 * @return  MI_SUCCESS             If the timer was successfully deleted.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied..
 * */
mible_status_t mible_timer_delete(void * timer_id) 
{
	uint32_t errno;
	int id = free_timer(timer_id);
	if (id == -1)
		return MI_ERR_INVALID_PARAM;

	errno = app_timer_stop((app_timer_id_t)timer_id);
	return (mible_status_t)errno;
}

/*
 * @brief 	Start a timer.
 * @param 	[in] timer_id: timer id
 *          [in] timeout_value: Number of milliseconds to time-out event
 * (minimum 10 ms).
 * 			[in] p_context: parameters that can be passed to
 * timeout_handler
 *
 * @return  MI_SUCCESS             If the timer was successfully started.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *          MI_ERR_INVALID_STATE   If the application timer module has not been
 * initialized or the timer has not been created.
 *         	MI_ERR_NO_MEM          If the timer operations queue was full.
 * @note 	If the timer has already started, it will start counting again.
 * */
mible_status_t mible_timer_start(void* timer_id, uint32_t timeout_value,
    void* p_context)
{
	uint32_t errno;
	errno = app_timer_start((app_timer_id_t)timer_id, APP_TIMER_TICKS(timeout_value, 0), p_context);
    return (mible_status_t)errno;
}

/*
 * @brief 	Stop a timer.
 * @param 	[in] timer_id: timer id
 * @return  MI_SUCCESS             If the timer was successfully stopped.
 *          MI_ERR_INVALID_PARAM   Invalid timer id supplied.
 *
 * */
mible_status_t mible_timer_stop(void* timer_id) 
{
	uint32_t errno;
	errno = app_timer_stop((app_timer_id_t)timer_id);
	return (mible_status_t)errno; 
}

/* FLASH related function*/

/*
 * @brief 	Create a record in flash 
 * @param 	[in] record_id: identify a record in flash 
 * 			[in] len: record length
 * @return 	MI_SUCCESS 				Create successfully.
 * 			MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 *allowed size.
 *   		MI_ERR_NO_MEM,			Not enough flash memory to be assigned 
 * 				
 * */
mible_status_t mible_record_create(uint16_t record_id, uint8_t len)
{
	static uint8_t fds_has_init = 0;

	if (fds_has_init == 0) {
		fds_has_init = 1;
		mi_psm_init();
	}
	
	// actually it does not need record_id and len

	return MI_SUCCESS;	
}


/*
 * @brief  	Delete a record in flash
 * @param 	[in] record_id: identify a record in flash  
 * @return 	MI_SUCCESS 				Delete successfully. 
 * 			MI_ERR_INVALID_PARAMS   Invalid record id supplied.
 * */
mible_status_t mible_record_delete(uint16_t record_id)
{
	uint32_t errno;
	errno = mi_psm_record_delete(record_id);
	return (mible_status_t)errno;
}

/*
 * @brief 	Restore data to flash
 * @param 	[in] record_id: identify an area in flash
 * 			[out] p_data: pointer to data
 *			[in] len: data length
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 *allowed size.
 *          MI_ERR_INVALID_PARAMS   Invalid record id supplied.
 *          MI_ERR_INVALID_ADDR     Invalid pointer supplied.
 * */
mible_status_t mible_record_read(uint16_t record_id, uint8_t* p_data,
    uint8_t len)
{
	uint32_t errno;
	errno = mi_psm_record_read(record_id, p_data, len);
    return (mible_status_t)errno;
}

