MiEcosystem/mijia_ble_api/nRF5_api.c
/*
 * @brief 	Store data to flash
 * @param 	[in] record_id: identify an area in flash
 * 			[in] p_data: pointer to data
 * 			[in] len: data length
 * @return  MI_SUCCESS              The command was accepted.
 *          MI_ERR_INVALID_LENGTH   Size was 0, or higher than the maximum
 * allowed size.
 *          MI_ERR_INVALID_PARAMS   p_data is not aligned to a 4 byte boundary.
 * @note  	Should use asynchronous mode to implement this function.
 *          The data to be written to flash has to be kept in memory until the
 * operation has terminated, i.e., an event is received.
 * 			When record writing complete , call mible_arch_event_callback function and pass MIBLE_ARCH_EVT_RECORD_WRITE_CMP event and result. 
 * */
mible_status_t mible_record_write(uint16_t record_id, uint8_t* p_data,
    uint8_t len)
{
	uint32_t errno;
	errno = mi_psm_record_write(record_id, p_data, len);
    return (mible_status_t)errno;
}

/*
 * @brief 	Get ture random bytes .
 * @param 	[out] p_buf: pointer to data
 * 			[in] len: Number of bytes to take from pool and place in
 * p_buff
 * @return  MI_SUCCESS			The requested bytes were written to
 * p_buff
 *          MI_ERR_NO_MEM       No bytes were written to the buffer, because
 * there were not enough random bytes available.
 * @note  	SHOULD use TRUE random num generator
 * */
mible_status_t mible_rand_num_generater(uint8_t* p_buf, uint8_t len)
{
	uint32_t errno;
	errno = sd_rand_application_vector_get(p_buf, len);
	return (mible_status_t)errno == MI_SUCCESS ? MI_SUCCESS : MI_ERR_NO_MEM;
}

/*
 * @brief 	Encrypts a block according to the specified parameters. 128-bit
 * AES encryption.
 * @param 	[in] key: encryption key
 * 			[in] plaintext: pointer to plain text
 * 			[in] plen: plain text length
 *          [out] ciphertext: pointer to cipher text
 * @return  MI_SUCCESS              The encryption operation completed.
 *          MI_ERR_INVALID_ADDR     Invalid pointer supplied.
 *          MI_ERR_INVALID_STATE    Encryption module is not initialized.
 *          MI_ERR_INVALID_LENGTH   Length bigger than 16.
 *          MI_ERR_BUSY             Encryption module already in progress.
 * @note  	SHOULD use synchronous mode to implement this function
 * */
mible_status_t mible_ecb128_encrypt(const uint8_t* key,
    const uint8_t* plaintext, uint8_t plen,
    uint8_t* ciphertext)
{
	uint32_t errno;
	nrf_ecb_hal_data_t ctx = {0};

	if ( plaintext == NULL || key == NULL)
		return MI_ERR_INVALID_ADDR;
	else if (plen > 16)
		return MI_ERR_INVALID_LENGTH;

	memcpy(ctx.key, key, 16);
	memcpy(ctx.cleartext, plaintext, plen);
	errno = sd_ecb_block_encrypt(&ctx);
	memcpy(ciphertext, ctx.ciphertext, plen);

    return (mible_status_t)errno;
}

/*
 * @brief 	Post a task to a task quene, which can be executed in a right place(maybe a task in RTOS or while(1) in the main function).
 * @param 	[in] handler: a pointer to function 
 * 			[in] param: function parameters 
 * @return 	MI_SUCCESS 				Successfully put the handler to quene.		
 * 			MI_ERR_NO_MEM			The task quene is full. 
 * 			MI_ERR_INVALID_PARAM    Handler is NULL
 * */
mible_status_t mible_task_post(mible_handler_t handler, void *arg)
{
	uint32_t errno;
	if (handler == NULL)
		return MI_ERR_INVALID_PARAM;

	mible_task_t task = {.handler = handler, .arg = arg};
	errno = nrf_queue_push(&task_queue, &task);

	if (errno != NRF_SUCCESS)
		return MI_ERR_NO_MEM;
	else
		return MI_SUCCESS;
}

void mible_tasks_exec(void)
{
	uint32_t errno = 0;
	mible_task_t task;
	while(!errno) {
		errno = nrf_queue_pop(&task_queue, &task);
		if (errno == NRF_SUCCESS)
			task.handler(task.arg);
	}
}